DataProcessors/ЗагрузкаКурсовВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаКурсовВалют</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КурсВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НазваниеВалюты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦифровойКодВалюты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СимвольныйКодВалюты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЗагрузкаКурсовВалют/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Получить(Команда)
	Если Не ЗначениеЗаполнено(ДатаЗагрузки) Тогда 
		Сообщить("Не выбрана дата", СтатусСообщения.Важное);
		Возврат
	КонецЕсли;
	ТаблицаКурсаВалют.Очистить();
	ЗагрузитьКурсыВалют(ДатаЗагрузки);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКурсыВалют(ДатаЗагрузки)
	
	Прокси = WSСсылки.DailyInfo.СоздатьWSПрокси("http://web.cbr.ru/", "DailyInfo", "DailyInfoSoap");
	
	ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить("http://web.cbr.ru/").Получить("GetCursOnDate");	
	
	WSПараметр = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);
	WSПараметр.On_Date = ДатаЗагрузки;
	
	КурсыВалют = Прокси.GetCursOnDate(WSПараметр);
	
	Для Каждого Элемент Из КурсыВалют.GetCursOnDateResult.diffgram.ValuteData.ValuteCursOnDate Цикл 
		
		НоваяСтрокаТЗ = ТаблицаКурсаВалют.Добавить();
		НоваяСтрокаТЗ.НазваниеВалюты = Элемент.Vname;
		НоваяСтрокаТЗ.Номинал = Элемент.Vnom;
		НоваяСтрокаТЗ.ЦифровойКодВалюты = Элемент.Vcode;
		НоваяСтрокаТЗ.СимвольныйКодВалюты = Элемент.VChCode;
		НоваяСтрокаТЗ.КурсВалюты = Элемент.Vcurs;
		
		
		РегистрКурсыВалют = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
	
		РегистрКурсыВалют.Период = ДатаЗагрузки;
		РегистрКурсыВалют.НазваниеВалюты = Элемент.Vname;
		РегистрКурсыВалют.Номинал = Элемент.Vnom;
		РегистрКурсыВалют.ЦифровойКодВалюты = Элемент.Vcode;
		РегистрКурсыВалют.СимвольныйКодВалюты = Элемент.VChCode;
		РегистрКурсыВалют.КурсВалюты = Элемент.Vcurs;
		РегистрКурсыВалют.Записать(Истина);
		
        СсылкаНаСимвольныйКодВалюты = Справочники.Валюты.НайтиПоНаименованию(Элемент.VChCode);
		
		ЕСли Не ЗначениеЗаполнено(СсылкаНаСимвольныйКодВалюты) Тогда
			НовыйЭлемент = Справочники.Валюты.СоздатьЭлемент();
			
			НовыйЭлемент.Наименование = Элемент.VChCode;
			НовыйЭлемент.НаименованиеВалюты = Элемент.Vname;
			НовыйЭлемент.Записать();  
		КонецЕсли;
		
	КонецЦикла;
	
	

	
КонецПроцедуры
